[
  {
    "content": "# Hero's Journey\n\nThe \"monomyth\" is is a basic pattern is found in many narratives from around the world.\n\nThis template can guide you even if it seems out of place for your genre. Say, you are writing detective fiction, or scifi; the words \"talisman\" or \"Goddess\" seem out of place. Try to use each section as a metaphor and a trigger for your imagination.\n\n###### (adapted from Wikipedia, with some steps from *Christopher Vogler*'s 12 stage version)",
    "children": [
      {
        "content": "# Structure",
        "children": [
          {
            "content": "## Departure, Ordinary World\n\nThis is your chance to describe the world, and the main characters, before your story begins.\n\nThink of this as a \"before\" picture, to pair with the \"after\" picture once your story in complete.\n\nThings are mundane, but there are problems under the surface. And then, a call to adventure begins the story. The refusal of the call before crossing the threshold allows the hero to be *active* and choose a quest, rather than simply reacting to events.",
            "children": [
              {
                "content": "### Ordinary World\n\nThis is where the Hero's exists before his present story begins, oblivious of the adventures to come. It's his safe place. His everyday life where we learn crucial details about our Hero, his true nature, capabilities and outlook on life. This anchors the Hero as a human, just like you and me, and makes it easier for us to identify with him and hence later, empathize with his plight.\n\n*(add your own description of your story's \"Ordinary World\" here)*",
                "children": [
                  {
                    "content": "*(add your scenes or more details here)*"
                  }
                ]
              },
              {
                "content": "### The Call to adventure\n\nThe hero begins in a mundane situation of normality from which some information is received that acts as a call to head off into the unknown."
              },
              {
                "content": "### Refusal of the Call\nOften when the call is given, the future hero first refuses to heed it. This may be from a sense of duty or obligation, fear, insecurity, a sense of inadequacy, or any of a range of reasons that work to hold the person in his or her current circumstances."
              },
              {
                "content": "### Meeting the Mentor\nOnce the hero has committed to the quest, consciously or unconsciously, his guide and magical helper appears, or becomes known. More often than not, this supernatural mentor will present the hero with one or more talismans or artifacts that will aid them later in their quest."
              },
              {
                "content": "### The Crossing of the First Threshold\nThis is the point where the person actually crosses into the field of adventure, leaving the known limits of his or her world and venturing into an unknown and dangerous realm where the rules and limits are not known."
              }
            ]
          },
          {
            "content": "## Initiation, Special World\nThe ever increasing trials and obstacles the hero faces.",
            "children": [
              {
                "content": "### Belly of The Whale\nThe belly of the whale represents the final separation from the hero's known world and self. By entering this stage, the person shows willingness to undergo a metamorphosis."
              },
              {
                "content": "### Tests, Allies, Enemies\nNow finally out of his comfort zone the Hero is confronted with an ever more difficult series of challenges that test him in a variety of ways. Obstacles are thrown across his path; whether they be physical hurdles or people bent on thwarting his progress, the Hero must overcome each challenge he is presented with on the journey towards his ultimate goal. \n\nThe Hero needs to find out who can be trusted and who can't. He may earn allies and meet enemies who will, each in their own way, help prepare him for the greater ordeals yet to come. This is the stage where his skills and/or powers are tested and every obstacle that he faces helps us gain a deeper insight into his character and ultimately identify with him even more."
              },
              {
                "content": "### The Meeting With the Goddess\nThis is the point when the person experiences a love that has the power and significance of the all-powerful, all encompassing, unconditional love that a fortunate infant may experience with his or her mother. This is a very important step in the process and is often represented by the person finding the other person that he or she loves most completely."
              },
              {
                "content": "### Woman as Temptress\nIn this step, the hero faces those temptations, often of a physical or pleasurable nature, that may lead him or her to abandon or stray from his or her quest, which does not necessarily have to be represented by a woman. Woman is a metaphor for the physical or material temptations of life, since the hero-knight was often tempted by lust from his spiritual journey."
              },
              {
                "content": "### Atonement with the Father\nIn this step the person must confront and be initiated by whatever holds the ultimate power in his or her life. In many myths and stories this is the father, or a father figure who has life and death power. This is the center point of the journey. All the previous steps have been moving into this place, all that follow will move out from it. Although this step is most frequently symbolized by an encounter with a male entity, it does not have to be a male; just someone or thing with incredible power."
              },
              {
                "content": "### Apotheosis\nWhen someone dies a physical death, or dies to the self to live in spirit, he or she moves beyond the pairs of opposites to a state of divine knowledge, love, compassion and bliss. A more mundane way of looking at this step is that it is a period of rest, peace and fulfillment before the hero begins the return."
              },
              {
                "content": "### The Ultimate Boon\nThe ultimate boon is the achievement of the goal of the quest. It is what the person went on the journey to get. All the previous steps serve to prepare and purify the person for this step, since in many myths the boon is something transcendent like the elixir of life itself, or a plant that supplies immortality, or the holy grail."
              }
            ]
          },
          {
            "content": "## Return, Old World\nThe boon is achieved, the quest solved, but only because of a combination of who the hero is, and what happened so far.\n\nStill, the hero must now synthesize the old world, and the new.",
            "children": [
              {
                "content": "### Refusal of the Return\nHaving found bliss and enlightenment in the other world, the hero may not want to return to the ordinary world to bestow the boon onto his fellow man."
              },
              {
                "content": "### The Magic Flight\nSometimes the hero must escape with the boon, if it is something that the gods have been jealously guarding. It can be just as adventurous and dangerous returning from the journey as it was to go on it."
              },
              {
                "content": "### Rescue from Without\nJust as the hero may need guides and assistants to set out on the quest, oftentimes he or she must have powerful guides and rescuers to bring them back to everyday life, especially if the person has been wounded or weakened by the experience."
              },
              {
                "content": "### The Crossing of the Return Threshold\nThe trick in returning is to retain the wisdom gained on the quest, to integrate that wisdom into a human life, and then maybe figure out how to share the wisdom with the rest of the world."
              },
              {
                "content": "### Master of Two Worlds\nThis step is usually represented by a transcendental hero like Jesus or Gautama Buddha. For a human hero, it may mean achieving a balance between the material and spiritual. The person has become comfortable and competent in both the inner and outer worlds."
              },
              {
                "content": "### Freedom to Live\nMastery leads to freedom from the fear of death, which in turn is the freedom to live. This is sometimes referred to as living in the moment, neither anticipating the future nor regretting the past."
              }
            ]
          }
        ]
      },
      {
        "content": "# Characters",
        "children": [
          {
            "content": "# Archetypes\n- HEROES: Central figures in stories. Everyone is the hero of his or her own myth. \nSHADOWS: Villains, enemies, or perhaps the enemy within. This could be the repressed possibilities of the hero, his or her potential for evil. \n- MENTORS: The hero’s guide or guiding principles.  \n- HERALD: The one who brings the Call to Adventure. This could be a person or an event. \n- THRESHOLD GUARDIANS: The forces that stand in the way at important turning points, including jealous enemies, professional gatekeepers, or even the hero’s own fears \nand doubts. \n- SHAPESHIFTERS: In stories, creatures like vampires or werewolves who change shape. In life, the shapeshifter represents change. \n- TRICKSTERS: Clowns and mischief-makers. \n- ALLIES: Characters who help the hero throughout the quest. \n- WOMAN AS TEMPTRESS: Sometimes a female character offers danger to the hero (a femme fatale)"
          }
        ]
      }
    ]
  }
]