[
  {
    "content": "# 👋 Welcome to Gingko Writer\n\nThank you for signing up!\n\nThis is a private document for you to play around with.",
    "children": [
      {
        "content": "## Why should I use Gingko Writer?\nGingko is a new way to write that allows you to **tackle challenging projects** without getting overwhelmed.\n\nIt's been used:\n- to complete novels\n- to finish theses & dissertations\n- to write ebooks\n- to write academic papers for publication\n- \"And much more...\" 😃 \n\n*Read more in this card's children, to the right →*",
        "children": [
          {
            "content": "### Why it works\nOur short-term memory seems to be limited to ~7 items. The only way to **fit more into our minds**, is to group things together into \"chunks\". In Gingko Writer, you are always working with grouped chunks:\n- Each card is a chunk\n- ... which are grouped together under their parents\n\nBy doing this, you're able to also **think and write at different levels** : big-picture, details, and everything in between.",
            "children": [
              {
                "content": "#### Chunking - The Building Block of Expertise\nThere's more to chunking than just \"how much fits into your mind\". The ability to chunk things is what expertise *is*.\n\nChess players, as a common example, start off seeing a game as a series of individual moves. But by building expertise, they're able to see *sequences* of moves as a \"single thing\". Eventually, they're able to group many sequences together in their minds, and see a game as a fluid and evolving strategy.\n\nThe same happens with *expert writers*. They start off only being really think about their current paragraph or idea. But eventually, with practice, they're able to also keep in mind how that piece fits into the chapter, and how the chapter fits into the overall piece.\n\n**Gingko Writer is explicitly designed to allow you to think like this**, no matter what your skill level is.",
                "children": [
                  {
                    "content": "> \"As, therefore, in the case of animate bodies and organisms a certain magnitude is necessary, and a magnitude which may be easily embraced in one view; so in the plot, a certain length is necessary, and a length which can be easily embraced by the memory.\"\n<div style=\"text-align:right;\">— *Aristotle, Poetics VII*</div>",
                    "children": []
                  }
                ]
              },
              {
                "content": "#### Levels of Detail - Sculpting Your Ideas\nBy being able to see your work from many different \"levels of detail\" (big picture → smallest detail), you're able to shift your attention to where it needs to be at any given moment.\n\nOnce you've learned how to use Gingko Writer fluidly, writing becomes less about grinding through from start to end, and more like **sculpting your ideas**.",
                "children": [
                  {
                    "content": "> \"That goal will become clearer, will emerge slowly but surely, much as the rough draught turns into a sketch, and the sketch into a painting through the serious work done on it, through the elaboration of the original vague idea and through the consolidation of the first fleeting and passing thought.\"\n<div style=\"text-align:right;\">— *Vincent van Gogh*</div>",
                    "children": []
                  }
                ]
              }
            ]
          },
          {
            "content": "### Specific Use-cases\nRead more about a few sample use-cases for Gingko Writer:\n- Fiction\n- Non-fiction\n- Journaling",
            "children": [
              {
                "content": "#### Gingko for Fiction Writing\nFiction writing has always been seen as broken into segments of varying size: acts, sequences, scenes, beats.\n\nGingko Writer allows you to grow your story organically, but adding detail slowly over time to whatever part of your story suits your fancy at the moment. You can add placeholders for scenes, a blurb for an entire act, and full-on prose... all while keeping it in the right order and being able to see your story as a whole.\n\nIf you want to try it, click here to create your own [Hero's Journey](/import/heros-journey) to see one way Gingko Writer can be used to write fiction.",
                "children": []
              },
              {
                "content": "#### Gingko for Non-fiction\nNon-fiction writing can benefit a lot more from the \"rearrange at will\" aspect of Gingko. Whereas a story has only so much rearranging that would make sense, in non-fiction (whether prose, academic, essays, etc), the *order* in which information is presented can make a tremendous difference to how well your point comes across.\n\nFortunately, you don't need to choose between working on the structure/order of your ideas, or working on the content. Both happen in the same space, naturally.\n\nFor an example of how Gingko can be used in non-fiction, click here to see a sample [science paper](/import/academic-paper).",
                "children": []
              },
              {
                "content": "#### Gingko for Multi-Level Journaling\n\nIf you ever feel that time is just flying by, it may be because it's hard to see your life as a story *while you're in it*.\n\nMulti-level journaling is an antidote to this.\n\nThis allows you to **see the bigger story of your life** as it unfolds. It can give you clarity in a way that regular journals can't.\n\nThis is how it works:\n- Write an entry each day.\n- At the end of the week, write a summary entry for the week.\n- At the end of the month, write a summary entry for the month.\n- and so on, as high up the hierarchy as you like\n\nAnd that's it!\n\nIf you prefer to start with a timeline already built, and just add the entries, then you can click here to start with your own [timeline tree](/import/timeline).",
                "children": []
              }
            ]
          }
        ]
      },
      {
        "content": "## How do I use Gingko Writer?\nThe basic idea is : you write in \"cards\" like this one, and each card can have one or more child cards, forming a tree.\n\nThere are two modes in Gingko Writer:\n- **Normal mode**: For viewing your document's *structure*, or modifying it by adding cards or moving them around.\n- **Edit mode**: For writing or editing the *content* in cards (words, titles, images, etc).\n\nNeed more help?\nClick the <svg viewBox=\"64 64 896 896\" style=\"width: 24px;height: 24px\"><path d=\"M512 64C264.6 64 64 264.6 64 512s200.6 448 448 448 448-200.6 448-448S759.4 64 512 64zm0 708c-22.1 0-40-17.9-40-40s17.9-40 40-40 40 17.9 40 40-17.9 40-40 40zm62.9-219.5a48.3 48.3 0 00-30.9 44.8V620c0 4.4-3.6 8-8 8h-48c-4.4 0-8-3.6-8-8v-21.5c0-23.1 6.7-45.9 19.9-64.9 12.9-18.6 30.9-32.8 52.1-40.9 34-13.1 56-41.6 56-72.7 0-44.1-43.1-80-96-80s-96 35.9-96 80v7.6c0 4.4-3.6 8-8 8h-48c-4.4 0-8-3.6-8-8V420c0-39.3 17.2-76 48.4-103.3C430.4 290.4 470 276 512 276s81.6 14.5 111.6 40.7C654.8 344 672 380.7 672 420c0 57.8-38.1 109.8-97.1 132.5z\"></path></svg> icon at the bottom left, or press <span class=\"shortcut-key\">?</span>.",
        "children": [
          {
            "content": "### Top 4 Keyboard Shortcuts\n\n1. <span class=\"shortcut-key\">↑</span><span class=\"shortcut-key\">↓</span><span class=\"shortcut-key\">←</span><span class=\"shortcut-key\">→</span> to **move around** your document\n2. <span class=\"shortcut-key\">Enter</span> to **Edit** the current card\n3. <span class=\"shortcut-key\">Ctrl\\*</span><span class=\"shortcut-key\">Enter</span> to **Save edits**\n4. <span class=\"shortcut-key\">Ctrl\\*</span><span class=\"shortcut-key\">(arrows)</span> to **Add new cards**\n\n\\* *On macOS use <span class=\"shortcut-key\">⌘</span> instead of <span class=\"shortcut-key\">Ctrl</span>*\n\n<hr/>\nPress <span class=\"shortcut-key\">?</span> to see full list",
            "children": []
          },
          {
            "content": "### Using the Mouse\nTo keep you in the writing flow, the mouse should be used rarely. But there are two cases where it's easier to use the mouse:\n\n1. To center and select a card, click on it.\n1. To move a card (and it's children), drag on its left-border.",
            "children": [
              {
                "content": "#### Free-scrolling\nSometimes you want to scroll a column, without changing which card is currently selected. To do so, just mouse-over the column you want to scroll and use the scrollwheel or scroll gesture.",
                "children": []
              },
              {
                "content": "#### Zooming In/Out\nTo zoom out (for an overview), or zoom in (to focus on your content) press <span class=\"shortcut-key\">Ctrl</span> + the scrollwheel or scroll gesture.",
                "children": []
              }
            ]
          },
          {
            "content": "### Additional Functions\n- Search and \"jumping\"\n- Copy/pasting subtrees (even across documents)\n- Drag & Drop text from elsewhere\n- Import plain-text files",
            "children": []
          }
        ]
      },
      {
        "content": "## The Story of Gingko\nI found it very difficult to get my thoughts in order when writing my PhD thesis in physics.\n\nIn classic procrastination-mode, instead of buckling down to write anyway, I went off on a long quest for better writing software! 😅\n\nNone of the software I found worked the way my mind did, so I decided to try designing my own.",
        "children": []
      }
    ]
  }
]