Repository: gingko/client
Catalog: i18n/*.po
Languages: es

source: Cancel
es: Cancelar

source: Blank Tree
es: Vacío

source: Import JSON
es: Importar JSON

source: From Desktop or Online
es: Del App Escritorio o Web

source: Recent Documents
es: Documentos Recientes

source: Last Updated
es: Última Modificación

source: Last Opened
es: Última Apertura

source: Open Other Documents
es: Abrir Otros Documentos

source: Remove From List
es: Elminiar de la Lista

source: New Document...
es: Documento Nuevo...

source: Unsaved Changes...
es: Cambios No Guardados...

source: Saved Offline
es: Copia De Seguridad Guardada

# Changes Saved
source: Saved
es: Cambios Guardados

source: Synced
es: Sincronizado

source: Database Error...
es: Error de Database...

source: Last saved
es: Guardado

source: Last edit
es: Último cambio

source: Keyboard Shortcuts Help
es: Atajos de Teclado

source: Restore this Version
es: Restaurar esta Versión

source: to Edit
es: para Editar

source: Edit Card (Enter)
es: Editar Tarjeta (Enter)

source: to Navigate
es: para Navegar

source: to Add Child
es: para Agregar un Hijo

source: to Split Card to the Right
es: para Dividir la Tarjeta hacia la Derecha

source: Insert Child (Ctrl+L)
es: Agregar un Hijo (Ctrl+L)

source: to Add Below
es: para Agregar Abajo

source: to Split Card Down
es: para Dividir la Tarjeta hacia la Abajo

source: to Merge into Next
es: para Combinar la Tarjeta a la Siguiente

source: Insert Below (Ctrl+J)
es: Agregar Abajo (Ctrl+J)

source: to Add Above
es: para Agregar Arriba

source: to Split Card Upward
es: para Dividir la Tarjeta hacia la Arriba

source: to Merge into Previous
es: para Combinar la Tarjeta a la Anterior

source: Insert Above (Ctrl+K)
es: Agregar Arriba (Ctrl+K)

source: (arrows)
es: (flechas)

source: to Move
es: para Mover

source: to Delete
es: para Eliminar

source: Delete Card (Ctrl+Backspace)
es: Eliminar Tarjeta (Ctrl+Backspace)

source: More Formatting Options...
es: Guía de Sintaxis para Formato

source: for Bold
es: para Negrita

source: for Italic
es: para Itálica

source: to Save Changes
es: para Guardar Cambios

source: Save Changes (Ctrl+Enter)
es: Guardar Cambios (Ctrl+Enter)

source: to Cancel Changes
es: para Cancelar Cambios

source: Press '/' to search
es: Presiona '/' para buscar

source: Heading Font
es: Fuente de Titulos

source: Content Font
es: Fuente de Contenido

source: Editing/Monospace Font
es: Fuente de Edición

source: Session: %1 word
es: Sesión: %1 palabra

source: Total : %1 word
es: Total : %1 palabra

source: Card : %1 word
es: Tarjeta : %1 palabra

source: Subtree : %1 word
es: Subárbol : %1 palabra

source: Group : %1 word
es: Grupo : %1 palabra

source: Column : %1 word
es: Columna : %1 palabra

source: &File
es: &Archivo

source: &New
es: &Nuevo

source: &Open...
es: &Abrir...

source: Open &Recent
es: Abrir &Recientes

source: &Save
es: &Guardar

source: Saved
es: Guardado

source: Save &As...
es: Guardar Como...

source: &Import JSON File...
es: &Importar Archivo JSON...

source: Export as MS &Word
es: Exportar como MS &Word

source: Export as &Text
es: Exportar como &Texto

source: Export as &JSON...
es: Exportar como &JSON...

source: Entire Document...
es: Documento Entero...

source: Current Card and Children...
es: Tarjeta Actual y Sus Hijos...

source: Column %1
es: Columna %1

source: Repeat Last E&xport
es: Repetir la última exportación

source: Show Complete List...
es: Mostrar La Lista Entera...

source: &Close
es: &Cerrar

source: &Quit Gingko...
es: &Salir de Gingko...

source: &Edit
es: &Edición

source: &Undo
es: &Deshacer

source: &Redo
es: &Rehacer

source: Cu&t
es: Cor&tar

source: &Copy
es: &Copiar

source: &Paste
es: &Pegar

source: Select &All
es: &Seleccionar Todo

source: Cu&t Cards
es: Cor&tar Tarjetas

source: &Copy Cards
es: &Copiar Tarjetas

source: &Paste Cards
es: &Pegar Tarjetas

source: Paste Cards as Children
es: Pegar Tarjetas como Hijos

source: &View
es: &Ver

source: Select &Fonts...
es: Seleccionar &Fuentes...

source: Select &Language
es: Seleccionar &Idioma

source: &Zoom In
es: Acercar

source: Zoom &Out
es: Alejar

source: &Reset Zoom
es: Restablecer Zoom

source: Toggle Full Screen
es: Alternar Pantalla Completa

source: Help
es: Ayuda

source: Hide Help button
es: Ocultar botón de ayuda

source: Show Help button
es: Mostrar el botón de ayuda

source: &FAQ...
es: &Preguntas Mas Frecuentes...

source: Features &List && Known Bugs...
es: &Lista de Características y Errores Conocidos...

source: &Contact Adriano...
es: &Contactar Adriano...

source: Email Support...
es: Enviar correo al desarrollador...

source: &Buy a License...
es: Comprar una Licencia...

source: &Enter License...
es: Introducir Clave de Licencia...

source: Open Backups Folder...
es: Abrir Archivos de "Backup"...

source: Open &Debugging Tools
es: Abrir Herramientas de &Depuración

source: Current Gingko Version : %1
es: Versión actual de Gingko : %1

source: %1 will be updated to v%2 on exit
es: %1 se actualizará a v%2 cuando se cierre.

source: <a href="https://github.com/gingko/client/blob/master/CHANGELOG.md">Change list</a>: %1
es: <a href="https://github.com/gingko/client/blob/master/CHANGELOG.md">Lista de cambios</a>: %1

source: Are you sure you want to undo your changes?
es: ¿Seguro que quieres cancelar tus cambios?

source: Save
es: Guardar

source: Save changes
es: Guardar cambios

source: Save changes before closing?
es: ¿Guardar cambios antes de cerrar?

source: Some Changes Weren't Saved
es: Algunos Cambios No Fueron Guardados

source: Close Without Saving
es: Cerra Sin Guardar

source: Recover unsaved changes, or Discard them?
es: ¿Recuperar cambios no guardados, o descartarlos?

source: Discard Unsaved Changes
es: Descartar Cambios No Guardados

source: Recover
es: Recupéralos

source: Loading Error
es: Error al Abrir

source: Couldn't load file.
es: No pude abrir el archivo.

source: Save Error
es: Error al Guardar

source: The file wasn't saved. Please try again.
es: El archivo no fue guardado. Inténtalo de nuevo.

source: Export Error
es: Error al Exportar

source: Couldn't export. Try again.
es: No se pudo exportar. Inténtalo de nuevo.
